Catalogs/DMS_ВидыКартЛояльности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>DMS_ВидыКартЛояльности</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Персонализирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачислениеБалловОтТекущегоНакопления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьДействияБаллов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DMS_ПериодичностьДействияБаллов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействияБаллов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьСрокДействияБаллов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКарты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DMS_ТипыКартЛояльности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьРегламентноеЗадание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентноеЗаданиеGUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяЗаменаДисконтныхКарт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяЗаменаБонусныхКарт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Уровень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПривилегии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ШкалаНачисленияБаллов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>БалансОт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БалансДо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСуммы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПравилаЗаменыДисконтныхКарт</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДисконтнойКарты</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.DMS_ВидыКартЛояльности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номинал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПравилаЗаменыБонусныхКарт</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидБонуснойКарты</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.DMS_ВидыКартЛояльности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБалловОт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПравилаВыдачиКарт</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПрограммаЛояльности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Renault_ПрограммыЛояльности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номинал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Привилегии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Привилегия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.DMS_ПривилегииВладельцамБонусныхКарт</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/DMS_ТипыКартЛояльности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>DMS_ТипыКартЛояльности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дисконтная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бонусная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/DMS_ПериодичностьДействияБаллов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>DMS_ПериодичностьДействияБаллов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/DMS_ВидыКартЛояльности/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	БонусныйТипКарты = (Объект.ТипКарты = Перечисления.DMS_ТипыКартЛояльности.Бонусная);
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
						
		РасписаниеРегламентногоЗадания = Справочники.DMS_ВидыКартЛояльности.РасписаниеРегламентногоЗаданияПоУмолчанию();
		
		Объект.ИспользоватьРегламентноеЗадание = Истина;
		
	Иначе
		
		Если Объект.ТипКарты = Перечисления.DMS_ТипыКартЛояльности.Бонусная Тогда
			
			// Получаем расписание из самого регламентного задания
			// если РЗ не задано, то расписание = Неопределено и будет создано на клиенте в момент редактирования расписания.
			РасписаниеРегламентногоЗадания = Справочники.DMS_ВидыКартЛояльности.ПолучитьРасписаниеВыполненияОбменаДанными(Объект.Ссылка);
		
		КонецЕсли; 
		
	КонецЕсли;
		
	УстановитьВидимость();	
	УстановитьЗаголовкиПериодичностиСрокаДействияБаллов();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
		
	ТекущийОбъект.ИспользоватьРегламентноеЗадание = (Не ТекущийОбъект.ПометкаУдаления И ТекущийОбъект.ИспользоватьСрокДействияБаллов И ТекущийОбъект.ТипКарты = Перечисления.DMS_ТипыКартЛояльности.Бонусная);
	
	Справочники.DMS_ВидыКартЛояльности.ОбновитьДанныеРегламентногоЗадания(Отказ, РасписаниеРегламентногоЗадания, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НачислениеБалловОтТекущегоНакопленияПриИзменении(Элемент)
	УстановитьВидимость();	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьСрокДействияБалловПриИзменении(Элемент)
	УстановитьВидимость();	
КонецПроцедуры

&НаКлиенте
Процедура СрокДействияПриИзменении(Элемент)
	УстановитьЗаголовкиПериодичностиСрокаДействияБаллов();
КонецПроцедуры

&НаКлиенте
Процедура ТипКартыПриИзменении(Элемент)
	
	БонусныйТипКарты = (Объект.ТипКарты = Перечисления.DMS_ТипыКартЛояльности.Бонусная);
	
	УстановитьВидимость();	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()

	Элементы.СтраницаШкалаНачисленияБаллов.Видимость = Объект.НачислениеБалловОтТекущегоНакопления;	
	Элементы.СтраницаСрокДействия.Видимость			 = Объект.ИспользоватьСрокДействияБаллов;	
	
	Элементы.НачислениеБалловОтТекущегоНакопления.Видимость = БонусныйТипКарты;
	Элементы.ИспользоватьСрокДействияБаллов.Видимость 		= БонусныйТипКарты;
	Элементы.СтраницаПравилаЗаменыКарты.Видимость 		    = БонусныйТипКарты;
	Элементы.СтраницаПравилаЗаменыБонуснойКарты.Видимость   = БонусныйТипКарты;
	//Элементы.СтраницаШкалаНачисленияБаллов.Видимость 		= БонусныйТипКарты;
	//Элементы.СтраницаСрокДействия.Видимость 				= БонусныйТипКарты;
	Элементы.Уровень.Видимость 								= БонусныйТипКарты;
	Элементы.СтраницаВыдачаКарты.Видимость 					= БонусныйТипКарты;
	Элементы.СтраницаПривилегии.Видимость 					= БонусныйТипКарты;
	
КонецПроцедуры // УстановитьВидимость()

&НаСервере
Процедура УстановитьЗаголовкиПериодичностиСрокаДействияБаллов()

	Если Объект.СрокДействияБаллов = 1 Тогда
	
		СписокПериодичности = Элементы.Периодичность.СписокВыбора;
		
		ЭлементСписка = СписокПериодичности.НайтиПоЗначению(Перечисления.DMS_ПериодичностьДействияБаллов.День);
		ЭлементСписка.Представление = "дня";
		
		ЭлементСписка = СписокПериодичности.НайтиПоЗначению(Перечисления.DMS_ПериодичностьДействияБаллов.Месяц);
		ЭлементСписка.Представление = "месяца";
		
		ЭлементСписка = СписокПериодичности.НайтиПоЗначению(Перечисления.DMS_ПериодичностьДействияБаллов.Год);
		ЭлементСписка.Представление = "года";
		
	Иначе 
	
		СписокПериодичности = Элементы.Периодичность.СписокВыбора;
		
		ЭлементСписка = СписокПериодичности.НайтиПоЗначению(Перечисления.DMS_ПериодичностьДействияБаллов.День);
		ЭлементСписка.Представление = "дней";
		
		ЭлементСписка = СписокПериодичности.НайтиПоЗначению(Перечисления.DMS_ПериодичностьДействияБаллов.Месяц);
		ЭлементСписка.Представление = "месяцев";
		
		ЭлементСписка = СписокПериодичности.НайтиПоЗначению(Перечисления.DMS_ПериодичностьДействияБаллов.Год);
		ЭлементСписка.Представление = "лет";
		
	КонецЕсли; 	

КонецПроцедуры // УстановитьЗаголовкиПериодичностиСрокаДействияБаллов()
